DG.then(function () {
    var map,
        coordinates1,
        coordinates1,
        polyline1,
        polyline2;
    map = DG.map('map', {
        center: [56.85186831092376, 60.61202636221288],
        zoom: 15,
        scrollWheelZoom: false
    });

    coordinates1 = [
        [56.85724815769886, 60.61783206776958],
        [56.85772914553015, 60.61720979532867],
        [56.85747105526759, 60.61504257062065],
        [56.85282512606785, 60.62079322628152],
        [56.8536112202925, 60.62145841406318],
        [56.854467692215444, 60.62141549872243]
    ];
    coordinates2 = [
        [56.85724815769886, 60.61783206776958],
        [56.857778270463626, 60.617239299625446],
        [56.85752604623981, 60.614734116609],
        [56.85272884313149, 60.62075632463472],
        [56.84659899921258, 60.62880764489125],
        [56.84717857297073, 60.627789405665474],
        [56.846791327736426, 60.626850632586525]
    ];

    // создаем ломаную из массива географических точек
    polyline1 = DG.polyline(coordinates1, {
        color: '#23527C'
    }).addTo(map);
    polyline2 = DG.polyline(coordinates2, {
        color: '#FF391E'
    }).addTo(map);

    // подстраиваем центр карты и масштаб, чтобы ломаную было видно
    // map.fitBounds(polyline.getBounds());

    DG.marker([56.85724815769886, 60.61783206776958])
        .addTo(map)
        .bindLabel('Офис продаж "Автомакси", г. Екатеринбург, ул. Челюскинцев, 126', {
            static: true
        });

    DG.marker([56.854467692215444, 60.62141549872243])
        .addTo(map)
        .bindLabel('Установочный центр, г. Екатеринбург, ул. Восточная, 5Б/1', {
            static: true
        });

    DG.marker([56.84674128369621, 60.6268630435134])
        .addTo(map)
        .bindLabel('Установочный центр, г. Екатеринбург, ул.  Шарташская 23В', {
            static: true
        });

});


DG.then(function () {
    var map,
        coordinates1,
        coordinates1,
        polyline1,
        polyline2;
    map = DG.map('mapPlaneTable', {
        center: [56.85144076819792, 60.62687377234861],
        zoom: 14,
        scrollWheelZoom: false
    });

    coordinates1 = [
        [56.85724815769886, 60.61783206776958],
        [56.85772914553015, 60.61720979532867],
        [56.85747105526759, 60.61504257062065],
        [56.85282512606785, 60.62079322628152],
        [56.8536112202925, 60.62145841406318],
        [56.854467692215444, 60.62141549872243]
    ];
    coordinates2 = [
        [56.85724815769886, 60.61783206776958],
        [56.857778270463626, 60.617239299625446],
        [56.85752604623981, 60.614734116609],
        [56.85272884313149, 60.62075632463472],
        [56.84659899921258, 60.62880764489125],
        [56.84717857297073, 60.627789405665474],
        [56.846791327736426, 60.626850632586525]
    ];

    // создаем ломаную из массива географических точек
    polyline1 = DG.polyline(coordinates1, {
        color: '#23527C'
    }).addTo(map);
    polyline2 = DG.polyline(coordinates2, {
        color: '#FF391E'
    }).addTo(map);

    // подстраиваем центр карты и масштаб, чтобы ломаную было видно
    // map.fitBounds(polyline.getBounds());

    DG.marker([56.85724815769886, 60.61783206776958])
        .addTo(map)
        .bindLabel('Офис продаж "Автомакси", г. Екатеринбург, ул. Челюскинцев, 126', {
            static: true
        });

    DG.marker([56.854467692215444, 60.62141549872243])
        .addTo(map)
        .bindLabel('Установочный центр, г. Екатеринбург, ул. Восточная, 5Б/1', {
            static: true
        });

    DG.marker([56.84674128369621, 60.6268630435134])
        .addTo(map)
        .bindLabel('Установочный центр, г. Екатеринбург, ул.  Шарташская 23В', {
            static: true
        });

});